#define ES 0
#define CS 1
#define SS 2
#define DS 3

#define AX 0
#define CX 1
#define DX 2
#define BX 3
#define SP 4
#define BP 5
#define SI 6
#define DI 7

// es: cs: ss: ds:
unsigned int segment[4]; 
unsigned int ip;

// ax, cx, dx, bx, bp, sp, si, di
unsigned int reg[8];
unsigned int flags;

// 640KB хватит на всё + BIOS
unsigned char memory[1024 * 1024];

int effective_addr;
int effective_segment;

int has_modrm[256] = {
    
     1,1,1,1, 0,0,0,0, 1,1,1,1, 0,0,0,0,
     1,1,1,1, 0,0,0,0, 1,1,1,1, 0,0,0,0,
     1,1,1,1, 0,0,0,0, 1,1,1,1, 0,0,0,0,
     1,1,1,1, 0,0,0,0, 1,1,1,1, 0,0,0,0,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     1,1,1,1, 1,1,1,1, 1,1,1,1, 1,1,1,1,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     1,1,0,0, 1,1,1,1, 0,0,0,0, 0,0,0,0,
     1,1,1,1, 0,0,0,0, 1,1,1,1, 1,1,1,1,
     0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0,
     0,0,0,0, 0,0,1,1, 0,0,0,0, 0,0,1,1,
};
